app/controllers/articles_controller.rb

  def update

    #raise method will cause the application to pause and print out the params on an error page.
    @article.update(title: params[:article][:title], description: params[:article][:description])
---
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2020-01-14 17:25:36.059189"], ["id", 1]]